# NYC Public School Test Analysis

### Problem Statements:
##### 1. Best Schools for Maths in NYC
##### 2. Best School for Writing in NYC
##### 3. Top 10 schools based on SAT scores
##### 4. Borough ranking based on SAT  scores
##### 5. Top schools for Maths in Brooklyn and Staten Island

### Loading Database

In [16]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [17]:
%sql mysql://root:root@localhost/schools

In [18]:
%%sql
show tables

 * mysql://root:***@localhost/schools
1 rows affected.

[('sch_table_1',)]

In [20]:
%%sql 
select * 
from sch_table_1
limit 10

 * mysql://root:***@localhost/schools
10 rows affected.

[('A. Philip Randolph Campus High School', 'Manhattan', 'M540', 459, 453, 447, 74.0),
 ('Abraham Lincoln High School', 'Brooklyn', 'K410', 441, 422, 422, 54.9),
 ('Academy for Careers in Television and Film', 'Queens', 'Q404', 444, 458, 444, 95.0),
 ('Academy for College Preparation and Career Exploration (College Board)', 'Brooklyn', 'K465', 386, 397, 393, 57.3),
 ('Academy for Conservation and the Environment', 'Brooklyn', 'K515', 381, 397, 390, 50.8),
 ('Academy for Environmental Leadership', 'Brooklyn', 'K480', 365, 366, 348, 71.3),
 ('Academy for Health Careers', 'Brooklyn', 'K625', 406, 405, 396, 48.1),
 ('Academy for Language and Technology', 'Bronx', 'X082', 371, 334, 348, 78.9),
 ('Academy for Scholarship and Entrepreneurship (College Board)', 'Bronx', 'X362', 392, 408, 400, 63.4),
 ('Academy for Social Action (College Board)', 'Manhattan', 'M043', 357, 349, 365, 54.0)]

### Finding missing values

In [22]:
%%sql

SELECT COUNT(*)-COUNT(percent_tested) as num_test_missing, count(*) as num_schools
FROM sch_table_1

 * mysql://root:***@localhost/schools
1 rows affected.

[(0, 355)]

#### - No missing values

### Schools by building code

In [24]:
%%sql

## Finding number of unique building_code values

SELECT COUNT(DISTINCT building_code) as num_school_buildings
From sch_table_1

 * mysql://root:***@localhost/schools
1 rows affected.

[(223,)]

### 1. Best schools for Maths

In [25]:
%%sql

SELECT school_name, average_math
From sch_table_1
where average_math>=800*0.8   ## atleast 80% score out of 800
Order by average_math DESC

 * mysql://root:***@localhost/schools
9 rows affected.

[('Stuyvesant High School', 754),
 ('Bronx High School of Science', 714),
 ('Staten Island Technical High School', 711),
 ('Queens High School for the Sciences at York College', 701),
 ('High School for Mathematics, Science, and Engineering at City College', 683),
 ('Brooklyn Technical High School', 682),
 ('Townsend Harris High School', 680),
 ('High School of American Studies at Lehman College', 669),
 ('Eleanor Roosevelt High School', 641)]

### Lowest reading rate

In [26]:
%%sql

## Finding lowest average_reading

SELECT min(average_reading) as lowest_reading_score
From sch_table_1

 * mysql://root:***@localhost/schools
1 rows affected.

[(302,)]

### 2. Best Writing School

In [27]:
%%sql

SELECT school_name, average_writing as max_writing
From sch_table_1
Order by max_writing DESC
Limit 1

 * mysql://root:***@localhost/schools
1 rows affected.

[('Stuyvesant High School', 693)]

#### - Stuyvesant High School was also best in Maths

### 3. Top 10 Schools

In [28]:
%%sql


SELECT school_name , sum(average_math+average_reading+average_writing) as avg_sat
From sch_table_1
group by school_name
order by avg_sat DESC
LIMIT 10

 * mysql://root:***@localhost/schools
10 rows affected.

[('Stuyvesant High School', Decimal('2144')),
 ('Bronx High School of Science', Decimal('2041')),
 ('Staten Island Technical High School', Decimal('2041')),
 ('High School of American Studies at Lehman College', Decimal('2013')),
 ('Townsend Harris High School', Decimal('1981')),
 ('Queens High School for the Sciences at York College', Decimal('1947')),
 ('Bard High School Early College', Decimal('1914')),
 ('Brooklyn Technical High School', Decimal('1896')),
 ('High School for Mathematics, Science, and Engineering at City College', Decimal('1889')),
 ('Eleanor Roosevelt High School', Decimal('1889'))]

### 4. Ranking Boroughs

In [34]:
%%sql


SELECT borough,
count(*) as num_borough,
round(sum(average_math+average_reading+average_writing)/count(*),2) as avg_bor_sat
From sch_table_1
group by borough
order by avg_bor_sat DESC

 * mysql://root:***@localhost/schools
5 rows affected.

[('Staten Island', 9, Decimal('1438.22')),
 ('Queens', 65, Decimal('1348.58')),
 ('Manhattan', 84, Decimal('1338.67')),
 ('Brooklyn', 104, Decimal('1232.86')),
 ('Bronx', 93, Decimal('1206.66'))]

#### It is obvious that Staten Island have the highest avg_bor_sat despite being only 9 in num_borough

### 5.a Top schools in Brooklyn for maths

In [35]:
%%sql


SELECT school_name, average_math
From sch_table_1
where borough = 'Brooklyn'
order by average_math DESC
Limit 5

 * mysql://root:***@localhost/schools
5 rows affected.

[('Brooklyn Technical High School', 682),
 ('Brooklyn Latin School', 625),
 ('Leon M. Goldstein High School for the Sciences', 563),
 ('Millennium Brooklyn High School', 553),
 ('Midwood High School', 550)]

In [37]:
%%sql


SELECT avg(average_math)
From sch_table_1
where borough = 'Brooklyn'

 * mysql://root:***@localhost/schools
1 rows affected.

[(Decimal('417.3654'),)]

#### Brooklyn have the highest num_borough, so these are the top school in Brooklyn with their avg Maths score

### 5.b Top schools in Staten Island for maths

In [36]:
%%sql


SELECT school_name, average_math
From sch_table_1
where borough = 'Staten Island'
order by average_math DESC
Limit 5

 * mysql://root:***@localhost/schools
5 rows affected.

[('Staten Island Technical High School', 711),
 ('Susan E. Wagner High School', 496),
 ('Michael J. Petrides School', 483),
 ('CSI High School for International Studies', 477),
 ('New Dorp High School', 454)]

In [38]:
%%sql


SELECT avg(average_math)
From sch_table_1
where borough = 'Staten Island'

 * mysql://root:***@localhost/schools
1 rows affected.

[(Decimal('485.3333'),)]

#### Top schools in Staten Island with their average maths score